{
    "testimonialsData": [
        {
            "name": "Linda MacSeafraidh",
            "rating": 4.5,
            "company": "Property Manager, Strata West",
            "testimonial": "I have worked with Dean at BC Roof Inspections on two major projects, both of which involved complicated roofing systems. Dean has provided all the information needed by the Owners of the Strata Corporation to make decisions and has communicated this information effectively to larger groups at general meetings. He prepares clear specifications and oversees a fair tendering process.\nDean’s hands on knowledge and exacting standards in overseeing roofing contractors have resulted in the installation of top quality roofs. Dean is on site on a regular basis, addresses the needs of the individual owners as they come up, keeps the residents informed of the progress of the work and any requirements of the owners, such as removing plant materials that may be affected by scaffolding and other work materials. Dean works hard to keep the job moving on schedule.\nDean is diligent in his role as roofing consultant and advocate for the Owners and Residents of Strata Corporations. I have no hesitation in recommending him as a Roof Consultant and Project Manager and look forward to working with him on future projects."
        },
        {
            "name": "Joanne Maclennen",
            "rating": 5,
            "company": "Strata President & Project Manager, Berkshyre Gardens",
            "testimonial": "I am writing to tell you how pleased we are with the services provided by your company.\nBoth you and Ted Neef were extremely professional and knowledgeable. From the original inspection, through the bidding process to the final inspection and sign off, you and Ted worked diligently to ensure that all work was performed to the proper specifications and our interests as owners were fully protected.\nAs you know we established a roofing committee and chose to take on the management of this project ourselves. You and Ted were extremely helpful and always available to answer our questions and provide sound advice.\n It was a real pleasure working with both of you over the course of this project and we look forward to seeing you again at the two-year inspection.\nOur strata will be pleased to recommend your company to others seeking roof inspection services."
        },
        {
            "name": "Ian Campbell",
            "rating": 5,
            "company": "Courthouse Square",
            "testimonial": "Dean assisted me finding roof leaks on my commercial office building, roof-size 5300 sq-ft.\nThree contractors offered to repair/renew my commercial torch-on roof for prices ranging from $5000 to $70,000. Dean suggested he find the leaks and repair them.\nDean studied my problem and isolated the leaks in a few hours, and guided me to use a skilled repair contractor who fixed the leaks in 3 hours for less than $500.\nDean is a great treasure and I will use him again for any roof problem I have in the future."
        },
        {
            "name": "Eric Stine",
            "rating": 5,
            "company": "Eric Stine Architect Inc.",
            "testimonial": "I have worked successfully with Dean Carate of BC Roof Inspections many times over the past 5 years on both residential and commercial projects including both new construction and restoration of existing buildings. The services provided have been reliable, knowledgeable, clear and professional at all times.\nI will work with them again on future projects and wouldn’t hesitate to recommend their services to others."
        },
        {
            "name": "Brenda Shaw P.Eng",
            "rating": 5,
            "company": "President, Level 5 Consulting Ltd.",
            "testimonial": "I have known Dean Carate the owner of BC Roof Inspections for over 12 years now. Dean is without a doubt the best roofing inspector I have ever come across in my 35 years in the construction business.\nDean and his staff are meticulous with their inspections and they are experts in all kinds of roofing. They inspect all kinds of roofing for my company from houses to high rises including re-roofing on apartments. They do a great job. They don’t accept sloppy work that is not up to industry standards. They stand firm and insist on a proper job. They are honest, upright guys that you can count on to do what is right for their clients. Whether it is new construction or re-roofing, BC Roof Inspections is who I rely on for all my roofing inspections needs.\nMy company has over 100 projects in construction right now and I hire BC Roof Inspections to inspect every single one. I have never had one call yet for a leaky roof on any project that BC Roof inspected.\n I would highly recommend them to any builder, developer or strata that needs a roofing expert."
        },
        {
            "name": "Charles Bristow",
            "rating": 5,
            "company": "Property Manager, Re/Max Property Management",
            "testimonial": "As a property manager I have a long list of “available contractors” that I can call on. The qualities that I look for in those who belong in my “A” list are as follows:\n• Great ongoing communication\n• In-depth knowledge of their particular field\n• Easy to get hold of\n• Rapid response\n• Excellent customer relationship skills\n• Value for money\n• Reliability\n• “Above and beyond” service\n• “Sense of humour” (because life is just too serious without one)\n• Given this demanding list there are not a lot of contractors who get an “A” rating from me but BC Roof Inspections is firmly in this category.\nDean, and his team, consistently tick all the necessary boxes and I would have no hesitation in recommending their services to anyone looking for a professional roof inspection."
        }
    ]
}