{
    "testimonialsData": [
        {
            "name": "Maurice D. Quinn",
            "company": "Homeowner",
            "testimonial": "The assessment on the condition of the roof on our home was more detailed than we had expected. The report was thoroughly explained and the office staff were a pleasure to deal with, and their prompt response to our inquiries really sealed the deal. If you want to work with a reliable, and knowledgeable firm, look no further than BC Roof Inspections."
        },
        {
            "name": "Matthew Neville",
            "company": "Roy Dennis Roofing",
            "testimonial": "Always detailed, always professional. A great team here who set the gold standard in the industry from the detailed specifications, friendly and competent admin staff, and knowledgeable inspectors in the field who work cooperatively with all parties to get the job done right."
        },
        {
            "name": "Eric Stine",
            "company": "MAIBC",
            "testimonial": "I have worked successfully with BC Roof Inspections many times over the past 5 years on both residential and commercial projects including both new construction and restoration of existing buildings. The services provided have been reliable, knowledgeable, clear and professional at all times. I will work with them again on future projects and wouldn’t hesitate to recommend their services to others."
        },
        {
            "name": "Brenda Shaw",
            "company": "Level 5 Consulting",
            "testimonial": "They don’t accept sloppy work that is not up to industry standards. They stand firm and insist on a proper job. They are honest, upright guys that you can count on to do what is right for their clients. Whether it is new construction or re-roofing, BC Roof Inspections is who I rely on for all my roofing inspection needs. I would highly recommend them to any builder, developer or strata that needs a roofing expert."
        },
        {
            "name": "Linda MacSeafraidh",
            "company": "StrataWest",
            "testimonial": "BC Roof Inspections provided all the information needed by the Owners of the Strata Corporation to make decisions and has communicated this information effectively to larger groups at general meetings. Their hands-on knowledge and exacting standards in overseeing roofing contractors have resulted in the installation of top-quality roofs. The inspectors are diligent in their role as a roofing consultant and advocate for the Owners and Residents of Strata Corporations."
        },
        {
            "name": "Charles Bristow",
            "company": "Property Manager, Re/Max Property Management",
            "testimonial": "As a property manager, I have a long list of available contractors that I can call on. I have a demanding list of qualities that I look for in those who belong in my “A” list. Given this demanding list, there are not a lot of contractors who get an “A” rating from me, but BC Roof Inspections is firmly in this category. I would have no hesitation in recommending their services to anyone looking for a professional roof inspection."
        },
        {
            "name": "Ian Campbell",
            "company": "Courthouse Square",
            "testimonial": "BC Roof Inspections assisted me in finding roof leaks on my commercial office building, roof-size 5300 sqft. The inspector studied my problem and isolated the leaks in a few hours, and guided me to use a skilled repair contractor, who saved me a lot of money in comparison to other quotes I received. I will use BCRI again for any roof problem I have in the future."
        },
        {
            "name": "Joanne Maclennan",
            "company": "Strata President, Berkshyre Gardens",
            "testimonial": "I am writing to tell you how pleased we are with the services provided by BCRI. Their inspectors were extremely professional and knowledgeable. From the original inspection, through the bidding process to the final inspection, BCRI staff worked diligently to ensure that all work was performed to the proper specifications and our interests as owners were fully protected. It was a real pleasure working with BCRI over the course of this project and we look forward to hiring them again at the two-year inspection."
        }
    ]
}